package com.example.routeschedule.data

object TransportSchedule {


    private val bus = mapOf(
        Pair(
            1, listOf(
                "ДС Веснянка",
                "Нарочанская",
                "Минск - Арена",
                "Университет физкультуры",
                "Радужная",
                "Крупцы",
                "Футбольный манеж",
                "Площадь Государственного флага",
                "Республиканский центр тенниса",
                "Комсомольское озеро",
                "Гвардейская",
                "Гостиница Юбилейная",
                "Замчище",
                "Площадь Свободы",
                "Ленина",
                "Кирова"
            )
        ), Pair(
            69, listOf(
                "Вокзал",
                "Площадь Независимости",
                "Володарского",
                "Площадь Свободы",
                "Дворец Спорта",
                "Гостиница Юбилейная",
                "Музей истории Великой Отечественной войны",
                "Гвардейская",
                "Комсомольское озеро",
                "Республиканский центр тенниса",
                "2-е кольцо",
                "Михася Лынькова",
                "Михалянка",
                "Гаражи",
                "Петра Глебки",
                "Остановочный пункт электропоездов Масюковщина",
                "Городок",
                "Масюковщина"
            )
        ),
        Pair(
            28, listOf(
                "ДС Серова",
                "ДС Серова (посадка пассажиров)",
                "Жлобинская",
                "Минский областной лицей",
                "Слуцкий Гостинец",
                "Переулок Корженевского",
                "Завод Транзистор",
                "Завод Электроника",
                "Кинотеатр Электрон",
                "Площадь Казинца",
                "Гимназия",
                "Ландера",
                "Наполеона Орды",
                "Яна Чечота",
                "Каролинская",
                "Станция метро Малиновка",
                "Ежи Гедройца",
                "Студенческая деревня",
                "Парк Павлова",
                "Универсам Волгоград",
                "ТЦ Кирмаш",
                "Международный образовательный центр",
                "Алибегова",
                "Проспект Газеты Звязда",
                "Льва Сапеги",
                "Янки Брыля",
                "Глаголева",
                "Силикатный переулок",
                "Роддом",
                "ДС Одоевского",
                "Станция метро Спортивная",
                "Петра Глебки",
                "Школа №140",
                "Колледж технологии и дизайна",
                "Гаражи",
                "Школа № 132",
                "ДС Масюковщина",
                "Петра Глебки, 120",
                "Остановочный пункт электропоездов Масюковщина",
                "Городок",
                "Масюковщина"
            )
        )
    )

    val trolleybus = mapOf(
        Pair(
            31, listOf(
                "ДС Кунцевщина",
                "ДС Кунцевщина",
                "Поликлиника №26",
                "Станция метро Каменная Горка",
                "Барановщина",
                "Станция метро Кунцевщина",
                "Тимошенко",
                "Педагогический колледж",
                "Петра Глебки",
                "Станция метро Спортивная",
                "ДС Одоевского",
                "Роддом",
                "Бельского",
                "Гурского",
                "Газонаполнительная станция",
                "Глаголева",
                "Янки Брыля",
                "Колледж промышленности стройматериалов",
                "Станция метро Михалово",
                "Автостанция Юго-Западная",
                "Железнодорожная",
                "Ручей Мышка",
                "9-я больница",
                "ДС Семашко"
            )
        )
    )

    val tram = mapOf(
        Pair(
            1, listOf(
                "ДС Зелёный Луг",
                "Седых",
                "Калиновского",
                "Полиграфическая",
                "Олешева",
                "Севастопольская",
                "Волгоградская",
                "Белинского",
                "Ломоносова",
                "Чернышевского",
                "БНТУ",
                "Дорошевича",
                "Площадь Якуба Коласа",
                "Пугачёвская",
                "Красная",
                "Проспект Независимости",
                "Змитрока Бядули",
                "Захарова",
                "Парк Горького",
                "Лицей БГУ",
                "Стадион Динамо",
                "Свердлова",
                "Вокзал",
                "Ленинградская",
                "Площадь Мясникова (высадка пассажиров)",
                "Площадь Мясникова"
            )
        )
    )


    val busSchedule = listOf(
        "05:30 05:40 05:50",
        "06:00 06:09 06:18 06:27 06:36 06:44 06:53",
        "07:07 07:14 07:20 07:26 07:36 07:45",
        """08:01 08:09 08:24 08:29 08:35 08:41 08:56""",
        """09:05 09:22 09:38  09:45 09:54  """,
        """10:13 10:22 10:32 10:52""",
        """11:04 11:24 11:31 11:39 11:47""",
        """12:04 12:14 12:24 12:42 12:49 12:57""",
        """13:04 13:20 13:30 13:40 13:58 """,
        """14:05 14:13 14:21 14:38 14:47 14:57""",
        """15:14 15:19 15:25 15:30 15:43 15:50 15:58""",
        """16:13 16:21 16:34 16:40 16:46 16:58""",
        """17:04 17:10 17:17 17:32 17:40 17:54""",
        """18:00 18:07 18:19 18:26 18:33 18:40 18:57""",
        """19:07 19:17 19:28 19:48 19:58""",
        """20:08 20:28 20:37 20:47""",
        """21:06 21:15 21:31 21:51""",
        """22:03 22:25 22:36 22:48""",
        """23:11  23:23  23:47  00:01"""
    )


    fun getBusList(key: Int): List<String>? {
        return bus[key]
    }

    fun getTrolleyBusList(key: Int): List<String>? {
        return trolleybus[key]
    }

    fun getTramList(key: Int): List<String>? {
        return tram[key]
    }

    fun getSchedule(): List<String>? {
        return busSchedule
    }
}